source/_posts/2013-08-17-my-pentadactyl-tip.html
---
title: "使用 Pentadactyl (Firefox add-on)"
date: 2013-08-17
layout: post
categories: firefox
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">簡介</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Pentadactyl is a free browser add-on for Firefox, designed to make browsing
more efficient and especially more keyboard accessible.
</p>
</blockquote>
<p>
<a href="http://5digits.org/pentadactyl/index">Pentadactyl</a> 是一個能讓你快速瀏覽網頁的一個火狐插件，其特點是用Vim-like的方式
來使用，也可以是說是以鍵盤來做瀏覽動作的一套按法。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">一些使用心得</h2>
<div class="outline-text-2" id="text-2">
<p>
<!-- more -->
先聲明有些是定制後的Pentadactyl才有的，所以預設的行為會和以下有些出入，還有我的鍵盤的敏感度也調高了。
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">快速移動</h3>
<div class="outline-text-3" id="text-2-1">
<p>
按鍵 <code>j k</code> 分別為上下移動網頁約5%， <code>h l</code> 為切換瀏覽至左和右邊的Tab <code>space</code> 為向下一
個page，加前綴shift為上。僅僅這些基礎移動就大大超越還在用和滑鼠點擊分頁的我了！
但失去滑鼠滾輪還是有差別的，所以我的使用習慣變為 <code>space</code> 在網頁上下移動後，
之後使用 <code>j k</code> 微調一下。 <code>gg</code> 和 <code>G</code> 為頁首和尾。還有Mark頁面的功能呢！
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">如何點超連結？</h3>
<div class="outline-text-3" id="text-2-2">
<p>
這有點說不清，實際用的情況是 <code>f</code> 後連結上頭會跑出英文字母，之後在照順序輸入你眼睛盯著
的連結上的英文字母， <code>F</code> 則是會開新分頁，是一個很實用的功能，我把連結上頭出現的東西改成以
<code>asdfjkl;</code> 排，這樣八個鍵，連移動手指頭都不需要！
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">開啟網頁</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>o</code> 在當前頁面開啟網頁， <code>t</code> 為開在新分頁，開啟後鍵入關鍵字，預設會使用Google搜尋，
有個很棒的功能叫Auto-Completion，使用時會根據關鍵字給予補全，這類似你在Google的搜尋欄
鍵入關鍵字時會從下方跑出一個列表供你選擇，常用補全的東西有歷史紀錄和剛剛提到搜尋引擎的補全，
更多其他補全我也還不清楚但已經很夠用了。
</p>

<p>
例如輸入個巴會出現我最近看到的和巴哈姆特 有關聯的網址和title但卻還跑出和巴士海峽相關的東西，
當然能允許你更精確列出來，接個空白鍵和gamer或哈，就會產生更加有關聯的資訊了。
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">其他實用的功能</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>r</code> 為更新網頁、 <code>d</code> 為刪除 、 <code>b</code> 則是變成文字輸出你的分頁後選擇， <code>數字+b</code> 則是直接跳轉至指定Tab
， <code>/</code> 是搜尋當前頁面， <code>u</code> 回復剛關閉的頁面也能補全最近關過得頁面， <code>Esc</code> 取消，其他的上官網看吧。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">一個小短片</h2>
<div class="outline-text-2" id="text-3">
<p>
兩分鐘的影片
<a href="http://youtu.be/BuANeWJR-lM">Pentadactyl show on youtube</a>
</p>
</div>
</div>
